# 정렬(sort)
- 데이터 정렬
- 기준
    - index => sort_index()
    - value => sort_value()

In [57]:
# 모듈 로딩
import pandas as pd
import numpy as np    # NaN 사용하기 위해 로딩

# 데이터 생성
df = pd.DataFrame({'value':[5,2,7,6,4],
                   'name':['John Kim','Gildong Hong', 'Tom','Lee','Annan Jung'],
                   'age':[12, np.nan, 10,6,np.nan]})

# 데이터 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   5 non-null      int64
 1   name    5 non-null      object
 2   age     3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [58]:
# 인덱스 및 컬럼 정보 확인
print(df.index, df.columns, sep='\n')

RangeIndex(start=0, stop=5, step=1)
Index(['value', 'name', 'age'], dtype='object')

In [59]:
# 정렬하기
# [기본값] 오름차순 : ascending=True => 내림차순 : ascending=False
df.sort_index(ascending=False)

   value          name   age
4      4    Annan Jung   NaN
3      6           Lee   6.0
2      7           Tom  10.0
1      2  Gildong Hong   NaN
0      5      John Kim  12.0

In [60]:
df

   value          name   age
0      5      John Kim  12.0
1      2  Gildong Hong   NaN
2      7           Tom  10.0
3      6           Lee   6.0
4      4    Annan Jung   NaN

In [61]:
# 특정 컬럼 기준 정렬 => sort_value
# name 컬럼으로 정렬
df.sort_values(by='name')

   value          name   age
4      4    Annan Jung   NaN
1      2  Gildong Hong   NaN
0      5      John Kim  12.0
3      6           Lee   6.0
2      7           Tom  10.0

In [62]:
df.sort_values(by='name', ascending=False)

   value          name   age
2      7           Tom  10.0
3      6           Lee   6.0
0      5      John Kim  12.0
1      2  Gildong Hong   NaN
4      4    Annan Jung   NaN

In [63]:
df.sort_values(by='name', ascending=False)

   value          name   age
2      7           Tom  10.0
3      6           Lee   6.0
0      5      John Kim  12.0
1      2  Gildong Hong   NaN
4      4    Annan Jung   NaN

In [64]:
[len(name) for name in df['name']]

[8, 12, 3, 3, 10]

In [75]:
df.sort_values(by='name', key=lambda length:[len(name) for name in df['name']])

   value          name   age
2      7           Tom  10.0
3      6           Lee   6.0
0      5      John Kim  12.0
4      4    Annan Jung   NaN
1      2  Gildong Hong   NaN

# 컬럼명 정렬 해보기
- list로 뽑아서 정렬 후 transpose 하는듯...?